rails_server/app/controllers/messages_controller.rb

  def index
    @you = User.find(session[:user])
    @conversations = []
    Message.where(sender_id: @you.id).each do |message|
      @conversations += [User.find(message.receiver_id).username]
    end
    Message.where(receiver_id: @you.id).each do |message|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "messages".* FROM "messages" WHERE "messages"."sender_id" = $1 LIMIT $2  [["sender_id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."receiver_id" = $1  [["receiver_id", 1]]

  def create
    # p paramss
    @receiver = User.find_by(username: params[:message][:receiver])
    @sender = User.find(session[:user])
    @conversation
    @message = Message.new(sender_id:@sender.id,receiver_id:@receiver.id,body:params[:message][:body])
    if @message.save
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "b"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "messages" ("body", "sender_id", "receiver_id", "created_at", "updated_at", "location") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "hello"], ["sender_id", 1], ["receiver_id", 25], ["created_at", 2016-12-19 22:28:16 UTC], ["updated_at", 2016-12-19 22:28:16 UTC], ["location", "41.8762291, -87.6532041"]]

  def show
    user = User.find_by(username:params[:id])
    you = User.find(session[:user])
    messages = Message.where(sender_id:[you.id,user.id], receiver_id: [user.id,you.id]).order(:created_at)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "a"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "messages".* FROM "messages" WHERE "messages"."sender_id" IN (38, 1) AND "messages"."receiver_id" IN (1, 38) AND (sender_id == 1 AND location != '') ORDER BY "messages"."created_at" DESC LIMIT $1  [["LIMIT", 1]]