rails_server/app/controllers/sessions_controller.rb

  def create
    # p paramss
    @user = User.find_by(username: params[:user][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "z"], ["LIMIT", 1]]