app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "eraince"], ["password_digest", "$2a$10$4CXditrCvGWkuoStOtuSIeGANSwOLMhl/GK.i4ZIEp3iLuelBTG9m"], ["created_at", 2016-12-16 20:06:38 UTC], ["updated_at", 2016-12-16 20:06:38 UTC]]
---
  def create
             p params
            # p 'http post request made to users create'
    @user = User.new(user_params)
    if @user.save